
# State **`s3://infrahouse-website-infra/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |    Destroy |
|:---------:|--------:|-----------:|-----------:|
|     ✅     |      11 |          3 |          0 |
## Affected resources by action

|  Action  | Resources                                                                 |
|:--------:|:--------------------------------------------------------------------------|
|    🟢     | `module.website.aws_security_group.alb`                                   |
|    🟢     | `module.website.aws_security_group.backend`                               |
|    🟢     | `module.website.aws_vpc_security_group_egress_rule.alb_outgoing`          |
|    🟢     | `module.website.aws_vpc_security_group_egress_rule.backend_outgoing`      |
|    🟢     | `module.website.aws_vpc_security_group_ingress_rule.alb_icmp`             |
|    🟢     | `module.website.aws_vpc_security_group_ingress_rule.alb_listener_port`    |
|    🟢     | `module.website.aws_vpc_security_group_ingress_rule.backend_icmp`         |
|    🟢     | `module.website.aws_vpc_security_group_ingress_rule.backend_ssh_input`    |
|    🟢     | `module.website.aws_vpc_security_group_ingress_rule.backend_ssh_local`    |
|    🟢     | `module.website.aws_vpc_security_group_ingress_rule.backend_user_traffic` |
|    🟢     | `module.website.aws_vpc_security_group_ingress_rule.https`                |
|    🟡     | `module.website.aws_alb.website`                                          |
|    🟡     | `module.website.aws_autoscaling_group.website`                            |
|    🟡     | `module.website.aws_launch_template.website`                              |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.website.aws_alb.website will be updated in-place
  ~ resource "aws_alb" "website" {
        id                                          = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/web20230818170821317100000008/03a64b8fc9f0f055"
        name                                        = "web20230818170821317100000008"
      ~ security_groups                             = [
          - "sg-089f1a85f05cbd32a",
        ] -> (known after apply)
        tags                                        = {}
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.website.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "web20231125205239428700000003"
        name                             = "web20231125205239428700000003"
        # (28 unchanged attributes hidden)

      ~ instance_refresh {
            # (2 unchanged attributes hidden)

          ~ preferences {
              ~ max_healthy_percentage       = 0 -> 100
                # (6 unchanged attributes hidden)
            }
        }

      ~ launch_template {
            id      = "lt-042ea5dd55b0fff3b"
            name    = "web20231125205151213200000001"
          ~ version = "4" -> (known after apply)
        }

        # (6 unchanged blocks hidden)
    }

  # module.website.aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                      = "lt-042ea5dd55b0fff3b"
      ~ image_id                = "ami-0ce2cb35386fc22e9" -> "ami-0ea80799a59ad106b"
      ~ latest_version          = 4 -> (known after apply)
        name                    = "web20231125205151213200000001"
        tags                    = {}
      ~ vpc_security_group_ids  = [] -> (known after apply)
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.website.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Load balancer security group for service website"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "web-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "website load balancer"
        }
      + tags_all               = {
          + "Name"        = "website load balancer"
          + "created_by"  = "infrahouse/infrahouse-website-infra"
          + "environment" = "production"
        }
      + vpc_id                 = "vpc-0ae798f941be45345"
    }

  # module.website.aws_security_group.backend will be created
  + resource "aws_security_group" "backend" {
      + arn                    = (known after apply)
      + description            = "Backend security group for service website"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "web-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "website backend"
        }
      + tags_all               = {
          + "Name"        = "website backend"
          + "created_by"  = "infrahouse/infrahouse-website-infra"
          + "environment" = "production"
        }
      + vpc_id                 = "vpc-0ae798f941be45345"
    }

  # module.website.aws_vpc_security_group_egress_rule.alb_outgoing will be created
  + resource "aws_vpc_security_group_egress_rule" "alb_outgoing" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "outgoing traffic"
        }
      + tags_all               = {
          + "Name"        = "outgoing traffic"
          + "created_by"  = "infrahouse/infrahouse-website-infra"
          + "environment" = "production"
        }
    }

  # module.website.aws_vpc_security_group_egress_rule.backend_outgoing will be created
  + resource "aws_vpc_security_group_egress_rule" "backend_outgoing" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "outgoing traffic"
        }
      + tags_all               = {
          + "Name"        = "outgoing traffic"
          + "created_by"  = "infrahouse/infrahouse-website-infra"
          + "environment" = "production"
        }
    }

  # module.website.aws_vpc_security_group_ingress_rule.alb_icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "alb_icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "ICMP traffic"
        }
      + tags_all               = {
          + "Name"        = "ICMP traffic"
          + "created_by"  = "infrahouse/infrahouse-website-infra"
          + "environment" = "production"
        }
      + to_port                = -1
    }

  # module.website.aws_vpc_security_group_ingress_rule.alb_listener_port will be created
  + resource "aws_vpc_security_group_ingress_rule" "alb_listener_port" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "User traffic to port 80"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "user traffic"
        }
      + tags_all               = {
          + "Name"        = "user traffic"
          + "created_by"  = "infrahouse/infrahouse-website-infra"
          + "environment" = "production"
        }
      + to_port                = 80
    }

  # module.website.aws_vpc_security_group_ingress_rule.backend_icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "backend_icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "ICMP traffic"
        }
      + tags_all               = {
          + "Name"        = "ICMP traffic"
          + "created_by"  = "infrahouse/infrahouse-website-infra"
          + "environment" = "production"
        }
      + to_port                = -1
    }

  # module.website.aws_vpc_security_group_ingress_rule.backend_ssh_input will be created
  + resource "aws_vpc_security_group_ingress_rule" "backend_ssh_input" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/22"
      + description            = "SSH access from the service specified CIDR range"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "SSH additional"
        }
      + tags_all               = {
          + "Name"        = "SSH additional"
          + "created_by"  = "infrahouse/infrahouse-website-infra"
          + "environment" = "production"
        }
      + to_port                = 22
    }

  # module.website.aws_vpc_security_group_ingress_rule.backend_ssh_local will be created
  + resource "aws_vpc_security_group_ingress_rule" "backend_ssh_local" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.4.0/22"
      + description            = "SSH access from the service website VPC"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "SSH local"
        }
      + tags_all               = {
          + "Name"        = "SSH local"
          + "created_by"  = "infrahouse/infrahouse-website-infra"
          + "environment" = "production"
        }
      + to_port                = 22
    }

  # module.website.aws_vpc_security_group_ingress_rule.backend_user_traffic will be created
  + resource "aws_vpc_security_group_ingress_rule" "backend_user_traffic" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.4.0/22"
      + description            = "User traffic from the Load Balancer"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "user traffic"
        }
      + tags_all               = {
          + "Name"        = "user traffic"
          + "created_by"  = "infrahouse/infrahouse-website-infra"
          + "environment" = "production"
        }
      + to_port                = 80
    }

  # module.website.aws_vpc_security_group_ingress_rule.https will be created
  + resource "aws_vpc_security_group_ingress_rule" "https" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "User traffic to HTTPS port"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "https user traffic"
        }
      + tags_all               = {
          + "Name"        = "https user traffic"
          + "created_by"  = "infrahouse/infrahouse-website-infra"
          + "environment" = "production"
        }
      + to_port                = 443
    }

Plan: 11 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: module.cdn.aws_acm_certificate.cdn: Refreshing state... [id=arn:aws:acm:us-east-1:493370826424:certificate/a09201ea-e83d-43ab-8abd-75004b7d5aa5]%0Adata.aws_iam_policy_document.webserver_permissions: Reading...%0Adata.aws_iam_policy_document.webserver_permissions: Read complete after 0s [id=2218315402]%0Adata.aws_route53_zone.infrahouse_com: Reading...%0Adata.aws_ami.ubuntu_22: Reading...%0Amodule.cdn.data.aws_route53_zone.ih_com: Reading...%0Amodule.website-vpc.data.aws_vpc.management_vpc[0]: Reading...%0Adata.aws_availability_zones.uw1: Reading...%0Amodule.webserver_userdata.data.aws_region.current: Reading...%0Amodule.website.module.webserver_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/webserver20230818170808801500000002]%0Amodule.website.module.webserver_profile.data.aws_iam_policy_document.assume: Reading...%0Amodule.cdn.aws_cloudfront_cache_policy.default: Refreshing state... [id=ea742fff-3eb3-4437-bfce-2ef431afcfcc]%0Amodule.website-vpc.aws_vpc.vpc: Refreshing state... [id=vpc-0ae798f941be45345]%0Amodule.webserver_userdata.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.website.data.aws_caller_identity.current: Reading...%0Amodule.website.module.webserver_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=2851119427]%0Adata.aws_key_pair.aleks: Reading...%0Amodule.website.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.webserver_userdata.data.cloudinit_config.config: Reading...%0Amodule.webserver_userdata.data.cloudinit_config.config: Read complete after 0s [id=3987101430]%0Amodule.website.module.webserver_profile.aws_iam_role.profile: Refreshing state... [id=webserver20230818170808794200000001]%0Amodule.cdn.aws_cloudfront_distribution.repo: Refreshing state... [id=E2S8EXIANFSP8E]%0Amodule.website.module.webserver_profile.aws_iam_role_policy_attachment.profile: Refreshing state... [id=webserver20230818170808794200000001-20230818170809342500000004]%0Amodule.website.module.webserver_profile.aws_iam_instance_profile.profile: Refreshing state... [id=webserver]%0Adata.aws_route53_zone.infrahouse_com: Read complete after 0s [id=Z07662251LH3YRF2ERM3G]%0Amodule.website.data.aws_route53_zone.webserver_zone: Reading...%0Adata.aws_availability_zones.uw1: Read complete after 0s [id=us-west-1]%0Amodule.website-vpc.aws_eip.nat_eip["10.0.5.0/24"]: Refreshing state... [id=eipalloc-0beb080e46efeb93f]%0Amodule.website-vpc.aws_eip.nat_eip["10.0.4.0/24"]: Refreshing state... [id=eipalloc-03ad22a4199a2bfe5]%0Adata.aws_key_pair.aleks: Read complete after 0s [id=key-01c98b9723b518061]%0Amodule.website.data.aws_route53_zone.webserver_zone: Read complete after 0s [id=Z07662251LH3YRF2ERM3G]%0Adata.aws_ami.ubuntu_22: Read complete after 0s [id=ami-0ea80799a59ad106b]%0Amodule.website.aws_acm_certificate.website: Refreshing state... [id=arn:aws:acm:us-west-1:493370826424:certificate/771f1304-0282-41e5-b88e-7d4413d37428]%0Amodule.cdn.data.aws_route53_zone.ih_com: Read complete after 0s [id=Z07662251LH3YRF2ERM3G]%0Amodule.cdn.aws_route53_record.repo: Refreshing state... [id=Z07662251LH3YRF2ERM3G_cdn.infrahouse.com_A]%0Amodule.cdn.aws_route53_record.cert_validation["cdn.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__a71dbd0ecfc060d317944e3be1dbf59b.cdn.infrahouse.com._CNAME]%0Amodule.website-vpc.data.aws_vpc.management_vpc[0]: Read complete after 0s [id=vpc-08e19d859c26d18b2]%0Amodule.website-vpc.data.aws_route_tables.mgmt_route_tables[0]: Reading...%0Amodule.cdn.aws_acm_certificate_validation.repo: Refreshing state... [id=2023-08-21 23:33:58.663 +0000 UTC]%0Amodule.website.aws_route53_record.cert_validation["infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com._CNAME]%0Amodule.website-vpc.data.aws_route_tables.mgmt_route_tables[0]: Read complete after 1s [id=us-west-1]%0Amodule.website.aws_acm_certificate_validation.website: Refreshing state... [id=2023-11-25 21:20:23.244 +0000 UTC]%0Amodule.website-vpc.aws_default_route_table.default: Refreshing state... [id=rtb-06b702bdb0cadd810]%0Amodule.website-vpc.aws_vpc_peering_connection.link_to_management[0]: Refreshing state... [id=pcx-0fd00008e9a890b35]%0Amodule.website-vpc.aws_subnet.all["10.0.4.0/24"]: Refreshing state... [id=subnet-086ccf1b7842243d2]%0Amodule.website-vpc.aws_internet_gateway.ig: Refreshing state... [id=igw-0feb8f579048fc443]%0Amodule.website-vpc.aws_subnet.all["10.0.7.0/24"]: Refreshing state... [id=subnet-06f352185ffc3fcd3]%0Amodule.website-vpc.aws_default_security_group.default: Refreshing state... [id=sg-089f1a85f05cbd32a]%0Amodule.website-vpc.aws_route_table.all["10.0.5.0/24"]: Refreshing state... [id=rtb-0fc65675e5ce07bbf]%0Amodule.website-vpc.aws_subnet.all["10.0.5.0/24"]: Refreshing state... [id=subnet-05fa33164c768ab65]%0Amodule.website-vpc.aws_subnet.all["10.0.6.0/24"]: Refreshing state... [id=subnet-01306fa9e14f9c980]%0Amodule.website-vpc.aws_route_table.all["10.0.6.0/24"]: Refreshing state... [id=rtb-0decbbf0182384dff]%0Amodule.website-vpc.aws_route_table.all["10.0.7.0/24"]: Refreshing state... [id=rtb-0f0d4ab6650ed47a4]%0Amodule.website-vpc.aws_route_table.all["10.0.4.0/24"]: Refreshing state... [id=rtb-02ae9fc349324835b]%0Amodule.website-vpc.aws_route.default_main: Refreshing state... [id=r-rtb-06b702bdb0cadd8101080289494]%0Amodule.website-vpc.aws_route.route_from_mgmt_to_me[1]: Refreshing state... [id=r-rtb-04a16e74d5b12a3383177957334]%0Amodule.website-vpc.aws_route.route_from_mgmt_to_me[0]: Refreshing state... [id=r-rtb-0d73383afeb6ad1423177957334]%0Amodule.website-vpc.aws_route.route_from_mgmt_to_me[2]: Refreshing state... [id=r-rtb-067c30e65dd4108e93177957334]%0Amodule.website-vpc.aws_route.subnet_public["10.0.5.0/24"]: Refreshing state... [id=r-rtb-0fc65675e5ce07bbf1080289494]%0Amodule.website-vpc.aws_route.subnet_public["10.0.4.0/24"]: Refreshing state... [id=r-rtb-02ae9fc349324835b1080289494]%0Amodule.website-vpc.aws_route.route_from_me_to_mgmt["10.0.6.0/24"]: Refreshing state... [id=r-rtb-0decbbf0182384dff653952448]%0Amodule.website-vpc.aws_route.route_from_me_to_mgmt["10.0.5.0/24"]: Refreshing state... [id=r-rtb-0fc65675e5ce07bbf653952448]%0Amodule.website-vpc.aws_route.route_from_me_to_mgmt["10.0.7.0/24"]: Refreshing state... [id=r-rtb-0f0d4ab6650ed47a4653952448]%0Amodule.website-vpc.aws_route.route_from_me_to_mgmt["10.0.4.0/24"]: Refreshing state... [id=r-rtb-02ae9fc349324835b653952448]%0Amodule.website-vpc.aws_route_table_association.private_rt_assoc["10.0.5.0/24"]: Refreshing state... [id=rtbassoc-0716045ba5eb092f0]%0Amodule.website-vpc.aws_route_table_association.private_rt_assoc["10.0.6.0/24"]: Refreshing state... [id=rtbassoc-0c1a3e4c874333baf]%0Amodule.website-vpc.aws_nat_gateway.nat_gw["10.0.5.0/24"]: Refreshing state... [id=nat-00ac19ae43562352f]%0Amodule.website-vpc.aws_nat_gateway.nat_gw["10.0.4.0/24"]: Refreshing state... [id=nat-0a1c16012747ef5e4]%0Amodule.website-vpc.aws_route_table_association.private_rt_assoc["10.0.7.0/24"]: Refreshing state... [id=rtbassoc-0da0fea7d999fcf5f]%0Amodule.website-vpc.aws_route_table_association.private_rt_assoc["10.0.4.0/24"]: Refreshing state... [id=rtbassoc-04d711a4b92896be2]%0Amodule.website.data.aws_subnet.selected: Reading...%0Amodule.website-vpc.aws_route.subnet_private["10.0.6.0/24"]: Refreshing state... [id=r-rtb-0decbbf0182384dff1080289494]%0Amodule.website-vpc.aws_route.subnet_private["10.0.7.0/24"]: Refreshing state... [id=r-rtb-0f0d4ab6650ed47a41080289494]%0Amodule.website.data.aws_subnet.selected: Read complete after 0s [id=subnet-086ccf1b7842243d2]%0Amodule.website.data.aws_vpc.service: Reading...%0Amodule.website.aws_alb_target_group.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20231207162208215500000001/5cd6505e39abdb2b]%0Amodule.website.aws_launch_template.website: Refreshing state... [id=lt-042ea5dd55b0fff3b]%0Amodule.website.aws_alb.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/web20230818170821317100000008/03a64b8fc9f0f055]%0Amodule.website.data.aws_vpc.service: Read complete after 1s [id=vpc-0ae798f941be45345]%0Amodule.website.aws_route53_record.extra[0]: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_A]%0Amodule.website.aws_alb_listener.redirect_to_ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20230818170821317100000008/03a64b8fc9f0f055/3d984bc9f1cc3a7d]%0Amodule.website.aws_lb_listener.ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20230818170821317100000008/03a64b8fc9f0f055/b938cfdfa221ef4d]%0Amodule.website.aws_autoscaling_group.website: Refreshing state... [id=web20231125205239428700000003]%0Amodule.website.aws_autoscaling_policy.cpu_load: Refreshing state... [id=web20231125205239428700000003]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.website.aws_alb.website will be updated in-place%0A  ~ resource "aws_alb" "website" {%0A        id                                          = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/web20230818170821317100000008/03a64b8fc9f0f055"%0A        name                                        = "web20230818170821317100000008"%0A      ~ security_groups                             = [%0A          - "sg-089f1a85f05cbd32a",%0A        ] -> (known after apply)%0A        tags                                        = {}%0A        # (22 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.website.aws_autoscaling_group.website will be updated in-place%0A  ~ resource "aws_autoscaling_group" "website" {%0A        id                               = "web20231125205239428700000003"%0A        name                             = "web20231125205239428700000003"%0A        # (28 unchanged attributes hidden)%0A%0A      ~ instance_refresh {%0A            # (2 unchanged attributes hidden)%0A%0A          ~ preferences {%0A              ~ max_healthy_percentage       = 0 -> 100%0A                # (6 unchanged attributes hidden)%0A            }%0A        }%0A%0A      ~ launch_template {%0A            id      = "lt-042ea5dd55b0fff3b"%0A            name    = "web20231125205151213200000001"%0A          ~ version = "4" -> (known after apply)%0A        }%0A%0A        # (6 unchanged blocks hidden)%0A    }%0A%0A  # module.website.aws_launch_template.website will be updated in-place%0A  ~ resource "aws_launch_template" "website" {%0A        id                      = "lt-042ea5dd55b0fff3b"%0A      ~ image_id                = "ami-0ce2cb35386fc22e9" -> "ami-0ea80799a59ad106b"%0A      ~ latest_version          = 4 -> (known after apply)%0A        name                    = "web20231125205151213200000001"%0A        tags                    = {}%0A      ~ vpc_security_group_ids  = [] -> (known after apply)%0A        # (10 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.website.aws_security_group.alb will be created%0A  + resource "aws_security_group" "alb" {%0A      + arn                    = (known after apply)%0A      + description            = "Load balancer security group for service website"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = "web-"%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "website load balancer"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "website load balancer"%0A          + "created_by"  = "infrahouse/infrahouse-website-infra"%0A          + "environment" = "production"%0A        }%0A      + vpc_id                 = "vpc-0ae798f941be45345"%0A    }%0A%0A  # module.website.aws_security_group.backend will be created%0A  + resource "aws_security_group" "backend" {%0A      + arn                    = (known after apply)%0A      + description            = "Backend security group for service website"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = "web-"%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "website backend"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "website backend"%0A          + "created_by"  = "infrahouse/infrahouse-website-infra"%0A          + "environment" = "production"%0A        }%0A      + vpc_id                 = "vpc-0ae798f941be45345"%0A    }%0A%0A  # module.website.aws_vpc_security_group_egress_rule.alb_outgoing will be created%0A  + resource "aws_vpc_security_group_egress_rule" "alb_outgoing" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + ip_protocol            = "-1"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "outgoing traffic"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "outgoing traffic"%0A          + "created_by"  = "infrahouse/infrahouse-website-infra"%0A          + "environment" = "production"%0A        }%0A    }%0A%0A  # module.website.aws_vpc_security_group_egress_rule.backend_outgoing will be created%0A  + resource "aws_vpc_security_group_egress_rule" "backend_outgoing" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + ip_protocol            = "-1"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "outgoing traffic"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "outgoing traffic"%0A          + "created_by"  = "infrahouse/infrahouse-website-infra"%0A          + "environment" = "production"%0A        }%0A    }%0A%0A  # module.website.aws_vpc_security_group_ingress_rule.alb_icmp will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "alb_icmp" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + description            = "Allow all ICMP traffic"%0A      + from_port              = -1%0A      + id                     = (known after apply)%0A      + ip_protocol            = "icmp"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "ICMP traffic"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "ICMP traffic"%0A          + "created_by"  = "infrahouse/infrahouse-website-infra"%0A          + "environment" = "production"%0A        }%0A      + to_port                = -1%0A    }%0A%0A  # module.website.aws_vpc_security_group_ingress_rule.alb_listener_port will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "alb_listener_port" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + description            = "User traffic to port 80"%0A      + from_port              = 80%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "user traffic"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "user traffic"%0A          + "created_by"  = "infrahouse/infrahouse-website-infra"%0A          + "environment" = "production"%0A        }%0A      + to_port                = 80%0A    }%0A%0A  # module.website.aws_vpc_security_group_ingress_rule.backend_icmp will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "backend_icmp" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + description            = "Allow all ICMP traffic"%0A      + from_port              = -1%0A      + id                     = (known after apply)%0A      + ip_protocol            = "icmp"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "ICMP traffic"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "ICMP traffic"%0A          + "created_by"  = "infrahouse/infrahouse-website-infra"%0A          + "environment" = "production"%0A        }%0A      + to_port                = -1%0A    }%0A%0A  # module.website.aws_vpc_security_group_ingress_rule.backend_ssh_input will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "backend_ssh_input" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "10.0.0.0/22"%0A      + description            = "SSH access from the service specified CIDR range"%0A      + from_port              = 22%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "SSH additional"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "SSH additional"%0A          + "created_by"  = "infrahouse/infrahouse-website-infra"%0A          + "environment" = "production"%0A        }%0A      + to_port                = 22%0A    }%0A%0A  # module.website.aws_vpc_security_group_ingress_rule.backend_ssh_local will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "backend_ssh_local" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "10.0.4.0/22"%0A      + description            = "SSH access from the service website VPC"%0A      + from_port              = 22%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "SSH local"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "SSH local"%0A          + "created_by"  = "infrahouse/infrahouse-website-infra"%0A          + "environment" = "production"%0A        }%0A      + to_port                = 22%0A    }%0A%0A  # module.website.aws_vpc_security_group_ingress_rule.backend_user_traffic will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "backend_user_traffic" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "10.0.4.0/22"%0A      + description            = "User traffic from the Load Balancer"%0A      + from_port              = 80%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "user traffic"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "user traffic"%0A          + "created_by"  = "infrahouse/infrahouse-website-infra"%0A          + "environment" = "production"%0A        }%0A      + to_port                = 80%0A    }%0A%0A  # module.website.aws_vpc_security_group_ingress_rule.https will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "https" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + description            = "User traffic to HTTPS port"%0A      + from_port              = 443%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "https user traffic"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "https user traffic"%0A          + "created_by"  = "infrahouse/infrahouse-website-infra"%0A          + "environment" = "production"%0A        }%0A      + to_port                = 443%0A    }%0A%0APlan: 11 to add, 3 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS90ZXJyYWZvcm0udGZzdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAiVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvblxucGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOlxuICArIGNyZWF0ZVxuICB+IHVwZGF0ZSBpbi1wbGFjZVxuXG5UZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczpcblxuICAjIG1vZHVsZS53ZWJzaXRlLmF3c19hbGIud2Vic2l0ZSB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2VcbiAgfiByZXNvdXJjZSBcImF3c19hbGJcIiBcIndlYnNpdGVcIiB7XG4gICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6ZWxhc3RpY2xvYWRiYWxhbmNpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpsb2FkYmFsYW5jZXIvYXBwL3dlYjIwMjMwODE4MTcwODIxMzE3MTAwMDAwMDA4LzAzYTY0YjhmYzlmMGYwNTVcIlxuICAgICAgICBuYW1lICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ3ZWIyMDIzMDgxODE3MDgyMTMxNzEwMDAwMDAwOFwiXG4gICAgICB+IHNlY3VyaXR5X2dyb3VwcyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXG4gICAgICAgICAgLSBcInNnLTA4OWYxYTg1ZjA1Y2JkMzJhXCIsXG4gICAgICAgIF0gLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge31cbiAgICAgICAgIyAoMjIgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuXG4gICAgICAgICMgKDQgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLndlYnNpdGUuYXdzX2F1dG9zY2FsaW5nX2dyb3VwLndlYnNpdGUgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG4gIH4gcmVzb3VyY2UgXCJhd3NfYXV0b3NjYWxpbmdfZ3JvdXBcIiBcIndlYnNpdGVcIiB7XG4gICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ3ZWIyMDIzMTEyNTIwNTIzOTQyODcwMDAwMDAwM1wiXG4gICAgICAgIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ3ZWIyMDIzMTEyNTIwNTIzOTQyODcwMDAwMDAwM1wiXG4gICAgICAgICMgKDI4IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcblxuICAgICAgfiBpbnN0YW5jZV9yZWZyZXNoIHtcbiAgICAgICAgICAgICMgKDIgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuXG4gICAgICAgICAgfiBwcmVmZXJlbmNlcyB7XG4gICAgICAgICAgICAgIH4gbWF4X2hlYWx0aHlfcGVyY2VudGFnZSAgICAgICA9IDAgLT4gMTAwXG4gICAgICAgICAgICAgICAgIyAoNiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgICAgICAgICB9XG4gICAgICAgIH1cblxuICAgICAgfiBsYXVuY2hfdGVtcGxhdGUge1xuICAgICAgICAgICAgaWQgICAgICA9IFwibHQtMDQyZWE1ZGQ1NWIwZmZmM2JcIlxuICAgICAgICAgICAgbmFtZSAgICA9IFwid2ViMjAyMzExMjUyMDUxNTEyMTMyMDAwMDAwMDFcIlxuICAgICAgICAgIH4gdmVyc2lvbiA9IFwiNFwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgfVxuXG4gICAgICAgICMgKDYgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLndlYnNpdGUuYXdzX2xhdW5jaF90ZW1wbGF0ZS53ZWJzaXRlIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuICB+IHJlc291cmNlIFwiYXdzX2xhdW5jaF90ZW1wbGF0ZVwiIFwid2Vic2l0ZVwiIHtcbiAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgICAgPSBcImx0LTA0MmVhNWRkNTViMGZmZjNiXCJcbiAgICAgIH4gaW1hZ2VfaWQgICAgICAgICAgICAgICAgPSBcImFtaS0wY2UyY2IzNTM4NmZjMjJlOVwiIC0+IFwiYW1pLTBlYTgwNzk5YTU5YWQxMDZiXCJcbiAgICAgIH4gbGF0ZXN0X3ZlcnNpb24gICAgICAgICAgPSA0IC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgbmFtZSAgICAgICAgICAgICAgICAgICAgPSBcIndlYjIwMjMxMTI1MjA1MTUxMjEzMjAwMDAwMDAxXCJcbiAgICAgICAgdGFncyAgICAgICAgICAgICAgICAgICAgPSB7fVxuICAgICAgfiB2cGNfc2VjdXJpdHlfZ3JvdXBfaWRzICA9IFtdIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgIyAoMTAgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuXG4gICAgICAgICMgKDIgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLndlYnNpdGUuYXdzX3NlY3VyaXR5X2dyb3VwLmFsYiB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19zZWN1cml0eV9ncm91cFwiIFwiYWxiXCIge1xuICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgID0gXCJMb2FkIGJhbGFuY2VyIHNlY3VyaXR5IGdyb3VwIGZvciBzZXJ2aWNlIHdlYnNpdGVcIlxuICAgICAgKyBlZ3Jlc3MgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpbmdyZXNzICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgID0gXCJ3ZWItXCJcbiAgICAgICsgb3duZXJfaWQgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcmV2b2tlX3J1bGVzX29uX2RlbGV0ZSA9IGZhbHNlXG4gICAgICArIHRhZ3MgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiA9IFwid2Vic2l0ZSBsb2FkIGJhbGFuY2VyXCJcbiAgICAgICAgfVxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJ3ZWJzaXRlIGxvYWQgYmFsYW5jZXJcIlxuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9XG4gICAgICArIHZwY19pZCAgICAgICAgICAgICAgICAgPSBcInZwYy0wYWU3OThmOTQxYmU0NTM0NVwiXG4gICAgfVxuXG4gICMgbW9kdWxlLndlYnNpdGUuYXdzX3NlY3VyaXR5X2dyb3VwLmJhY2tlbmQgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3Nfc2VjdXJpdHlfZ3JvdXBcIiBcImJhY2tlbmRcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgPSBcIkJhY2tlbmQgc2VjdXJpdHkgZ3JvdXAgZm9yIHNlcnZpY2Ugd2Vic2l0ZVwiXG4gICAgICArIGVncmVzcyAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGluZ3Jlc3MgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ICAgICAgICAgICAgPSBcIndlYi1cIlxuICAgICAgKyBvd25lcl9pZCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByZXZva2VfcnVsZXNfb25fZGVsZXRlID0gZmFsc2VcbiAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiID0gXCJ3ZWJzaXRlIGJhY2tlbmRcIlxuICAgICAgICB9XG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIndlYnNpdGUgYmFja2VuZFwiXG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgIH1cbiAgICAgICsgdnBjX2lkICAgICAgICAgICAgICAgICA9IFwidnBjLTBhZTc5OGY5NDFiZTQ1MzQ1XCJcbiAgICB9XG5cbiAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2VncmVzc19ydWxlLmFsYl9vdXRnb2luZyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c192cGNfc2VjdXJpdHlfZ3JvdXBfZWdyZXNzX3J1bGVcIiBcImFsYl9vdXRnb2luZ1wiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgY2lkcl9pcHY0ICAgICAgICAgICAgICA9IFwiMC4wLjAuMC8wXCJcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaXBfcHJvdG9jb2wgICAgICAgICAgICA9IFwiLTFcIlxuICAgICAgKyBzZWN1cml0eV9ncm91cF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzZWN1cml0eV9ncm91cF9ydWxlX2lkID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgPSBcIm91dGdvaW5nIHRyYWZmaWNcIlxuICAgICAgICB9XG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIm91dGdvaW5nIHRyYWZmaWNcIlxuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLndlYnNpdGUuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5iYWNrZW5kX291dGdvaW5nIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZVwiIFwiYmFja2VuZF9vdXRnb2luZ1wiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgY2lkcl9pcHY0ICAgICAgICAgICAgICA9IFwiMC4wLjAuMC8wXCJcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaXBfcHJvdG9jb2wgICAgICAgICAgICA9IFwiLTFcIlxuICAgICAgKyBzZWN1cml0eV9ncm91cF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzZWN1cml0eV9ncm91cF9ydWxlX2lkID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgPSBcIm91dGdvaW5nIHRyYWZmaWNcIlxuICAgICAgICB9XG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIm91dGdvaW5nIHRyYWZmaWNcIlxuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLndlYnNpdGUuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYWxiX2ljbXAgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZVwiIFwiYWxiX2ljbXBcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGNpZHJfaXB2NCAgICAgICAgICAgICAgPSBcIjAuMC4wLjAvMFwiXG4gICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgPSBcIkFsbG93IGFsbCBJQ01QIHRyYWZmaWNcIlxuICAgICAgKyBmcm9tX3BvcnQgICAgICAgICAgICAgID0gLTFcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaXBfcHJvdG9jb2wgICAgICAgICAgICA9IFwiaWNtcFwiXG4gICAgICArIHNlY3VyaXR5X2dyb3VwX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNlY3VyaXR5X2dyb3VwX3J1bGVfaWQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3MgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiA9IFwiSUNNUCB0cmFmZmljXCJcbiAgICAgICAgfVxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJJQ01QIHRyYWZmaWNcIlxuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9XG4gICAgICArIHRvX3BvcnQgICAgICAgICAgICAgICAgPSAtMVxuICAgIH1cblxuICAjIG1vZHVsZS53ZWJzaXRlLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmFsYl9saXN0ZW5lcl9wb3J0IHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGVcIiBcImFsYl9saXN0ZW5lcl9wb3J0XCIge1xuICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBjaWRyX2lwdjQgICAgICAgICAgICAgID0gXCIwLjAuMC4wLzBcIlxuICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgID0gXCJVc2VyIHRyYWZmaWMgdG8gcG9ydCA4MFwiXG4gICAgICArIGZyb21fcG9ydCAgICAgICAgICAgICAgPSA4MFxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpcF9wcm90b2NvbCAgICAgICAgICAgID0gXCJ0Y3BcIlxuICAgICAgKyBzZWN1cml0eV9ncm91cF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzZWN1cml0eV9ncm91cF9ydWxlX2lkID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgPSBcInVzZXIgdHJhZmZpY1wiXG4gICAgICAgIH1cbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwidXNlciB0cmFmZmljXCJcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgfVxuICAgICAgKyB0b19wb3J0ICAgICAgICAgICAgICAgID0gODBcbiAgICB9XG5cbiAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5iYWNrZW5kX2ljbXAgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZVwiIFwiYmFja2VuZF9pY21wXCIge1xuICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBjaWRyX2lwdjQgICAgICAgICAgICAgID0gXCIwLjAuMC4wLzBcIlxuICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgID0gXCJBbGxvdyBhbGwgSUNNUCB0cmFmZmljXCJcbiAgICAgICsgZnJvbV9wb3J0ICAgICAgICAgICAgICA9IC0xXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlwX3Byb3RvY29sICAgICAgICAgICAgPSBcImljbXBcIlxuICAgICAgKyBzZWN1cml0eV9ncm91cF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzZWN1cml0eV9ncm91cF9ydWxlX2lkID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgPSBcIklDTVAgdHJhZmZpY1wiXG4gICAgICAgIH1cbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiSUNNUCB0cmFmZmljXCJcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgfVxuICAgICAgKyB0b19wb3J0ICAgICAgICAgICAgICAgID0gLTFcbiAgICB9XG5cbiAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5iYWNrZW5kX3NzaF9pbnB1dCB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlXCIgXCJiYWNrZW5kX3NzaF9pbnB1dFwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgY2lkcl9pcHY0ICAgICAgICAgICAgICA9IFwiMTAuMC4wLjAvMjJcIlxuICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgID0gXCJTU0ggYWNjZXNzIGZyb20gdGhlIHNlcnZpY2Ugc3BlY2lmaWVkIENJRFIgcmFuZ2VcIlxuICAgICAgKyBmcm9tX3BvcnQgICAgICAgICAgICAgID0gMjJcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaXBfcHJvdG9jb2wgICAgICAgICAgICA9IFwidGNwXCJcbiAgICAgICsgc2VjdXJpdHlfZ3JvdXBfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc2VjdXJpdHlfZ3JvdXBfcnVsZV9pZCA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiID0gXCJTU0ggYWRkaXRpb25hbFwiXG4gICAgICAgIH1cbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiU1NIIGFkZGl0aW9uYWxcIlxuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9XG4gICAgICArIHRvX3BvcnQgICAgICAgICAgICAgICAgPSAyMlxuICAgIH1cblxuICAjIG1vZHVsZS53ZWJzaXRlLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmJhY2tlbmRfc3NoX2xvY2FsIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGVcIiBcImJhY2tlbmRfc3NoX2xvY2FsXCIge1xuICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBjaWRyX2lwdjQgICAgICAgICAgICAgID0gXCIxMC4wLjQuMC8yMlwiXG4gICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgPSBcIlNTSCBhY2Nlc3MgZnJvbSB0aGUgc2VydmljZSB3ZWJzaXRlIFZQQ1wiXG4gICAgICArIGZyb21fcG9ydCAgICAgICAgICAgICAgPSAyMlxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpcF9wcm90b2NvbCAgICAgICAgICAgID0gXCJ0Y3BcIlxuICAgICAgKyBzZWN1cml0eV9ncm91cF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzZWN1cml0eV9ncm91cF9ydWxlX2lkID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgPSBcIlNTSCBsb2NhbFwiXG4gICAgICAgIH1cbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiU1NIIGxvY2FsXCJcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgfVxuICAgICAgKyB0b19wb3J0ICAgICAgICAgICAgICAgID0gMjJcbiAgICB9XG5cbiAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5iYWNrZW5kX3VzZXJfdHJhZmZpYyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlXCIgXCJiYWNrZW5kX3VzZXJfdHJhZmZpY1wiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgY2lkcl9pcHY0ICAgICAgICAgICAgICA9IFwiMTAuMC40LjAvMjJcIlxuICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgID0gXCJVc2VyIHRyYWZmaWMgZnJvbSB0aGUgTG9hZCBCYWxhbmNlclwiXG4gICAgICArIGZyb21fcG9ydCAgICAgICAgICAgICAgPSA4MFxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpcF9wcm90b2NvbCAgICAgICAgICAgID0gXCJ0Y3BcIlxuICAgICAgKyBzZWN1cml0eV9ncm91cF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzZWN1cml0eV9ncm91cF9ydWxlX2lkID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgPSBcInVzZXIgdHJhZmZpY1wiXG4gICAgICAgIH1cbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwidXNlciB0cmFmZmljXCJcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgfVxuICAgICAgKyB0b19wb3J0ICAgICAgICAgICAgICAgID0gODBcbiAgICB9XG5cbiAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5odHRwcyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlXCIgXCJodHRwc1wiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgY2lkcl9pcHY0ICAgICAgICAgICAgICA9IFwiMC4wLjAuMC8wXCJcbiAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICA9IFwiVXNlciB0cmFmZmljIHRvIEhUVFBTIHBvcnRcIlxuICAgICAgKyBmcm9tX3BvcnQgICAgICAgICAgICAgID0gNDQzXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlwX3Byb3RvY29sICAgICAgICAgICAgPSBcInRjcFwiXG4gICAgICArIHNlY3VyaXR5X2dyb3VwX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNlY3VyaXR5X2dyb3VwX3J1bGVfaWQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3MgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiA9IFwiaHR0cHMgdXNlciB0cmFmZmljXCJcbiAgICAgICAgfVxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJodHRwcyB1c2VyIHRyYWZmaWNcIlxuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9XG4gICAgICArIHRvX3BvcnQgICAgICAgICAgICAgICAgPSA0NDNcbiAgICB9XG5cblBsYW46IDExIHRvIGFkZCwgMyB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS5cblxuXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXG5cblNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuXG5cblRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OlxuICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIlxuOjpkZWJ1Zzo6VGVycmFmb3JtIGV4aXRlZCB3aXRoIGNvZGUgMC5cbjo6ZGVidWc6OnN0ZG91dDogbW9kdWxlLmNkbi5hd3NfYWNtX2NlcnRpZmljYXRlLmNkbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czphY206dXMtZWFzdC0xOjQ5MzM3MDgyNjQyNDpjZXJ0aWZpY2F0ZS9hMDkyMDFlYS1lODNkLTQzYWItOGFiZC03NTAwNGI3ZDVhYTVdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC53ZWJzZXJ2ZXJfcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LndlYnNlcnZlcl9wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjIxODMxNTQwMl0lMEFkYXRhLmF3c19yb3V0ZTUzX3pvbmUuaW5mcmFob3VzZV9jb206IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmNkbi5kYXRhLmF3c19yb3V0ZTUzX3pvbmUuaWhfY29tOiBSZWFkaW5nLi4uJTBBbW9kdWxlLndlYnNpdGUtdnBjLmRhdGEuYXdzX3ZwYy5tYW5hZ2VtZW50X3ZwY1swXTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2F2YWlsYWJpbGl0eV96b25lcy51dzE6IFJlYWRpbmcuLi4lMEFtb2R1bGUud2Vic2VydmVyX3VzZXJkYXRhLmRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkaW5nLi4uJTBBbW9kdWxlLndlYnNpdGUubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1fcG9saWN5LnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L3dlYnNlcnZlcjIwMjMwODE4MTcwODA4ODAxNTAwMDAwMDAyXSUwQW1vZHVsZS53ZWJzaXRlLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5jZG4uYXdzX2Nsb3VkZnJvbnRfY2FjaGVfcG9saWN5LmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVhNzQyZmZmLTNlYjMtNDQzNy1iZmNlLTJlZjQzMWFmY2ZjY10lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3ZwYy52cGM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXZwYy0wYWU3OThmOTQxYmU0NTM0NV0lMEFtb2R1bGUud2Vic2VydmVyX3VzZXJkYXRhLmRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLndlYnNpdGUuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUud2Vic2l0ZS5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI4NTExMTk0MjddJTBBZGF0YS5hd3Nfa2V5X3BhaXIuYWxla3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUud2Vic2l0ZS5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDkzMzcwODI2NDI0XSUwQW1vZHVsZS53ZWJzZXJ2ZXJfdXNlcmRhdGEuZGF0YS5jbG91ZGluaXRfY29uZmlnLmNvbmZpZzogUmVhZGluZy4uLiUwQW1vZHVsZS53ZWJzZXJ2ZXJfdXNlcmRhdGEuZGF0YS5jbG91ZGluaXRfY29uZmlnLmNvbmZpZzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mzk4NzEwMTQzMF0lMEFtb2R1bGUud2Vic2l0ZS5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuYXdzX2lhbV9yb2xlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYnNlcnZlcjIwMjMwODE4MTcwODA4Nzk0MjAwMDAwMDAxXSUwQW1vZHVsZS5jZG4uYXdzX2Nsb3VkZnJvbnRfZGlzdHJpYnV0aW9uLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUUyUzhFWElBTkZTUDhFXSUwQW1vZHVsZS53ZWJzaXRlLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2VydmVyMjAyMzA4MTgxNzA4MDg3OTQyMDAwMDAwMDEtMjAyMzA4MTgxNzA4MDkzNDI1MDAwMDAwMDRdJTBBbW9kdWxlLndlYnNpdGUubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1faW5zdGFuY2VfcHJvZmlsZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWJzZXJ2ZXJdJTBBZGF0YS5hd3Nfcm91dGU1M196b25lLmluZnJhaG91c2VfY29tOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0ddJTBBbW9kdWxlLndlYnNpdGUuZGF0YS5hd3Nfcm91dGU1M196b25lLndlYnNlcnZlcl96b25lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfYXZhaWxhYmlsaXR5X3pvbmVzLnV3MTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dXMtd2VzdC0xXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3NfZWlwLm5hdF9laXBbXCIxMC4wLjUuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWlwYWxsb2MtMGJlYjA4MGU0NmVmZWI5M2ZdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19laXAubmF0X2VpcFtcIjEwLjAuNC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1laXBhbGxvYy0wM2FkMjJhNDE5OWEyYmZlNV0lMEFkYXRhLmF3c19rZXlfcGFpci5hbGVrczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9a2V5LTAxYzk4Yjk3MjNiNTE4MDYxXSUwQW1vZHVsZS53ZWJzaXRlLmRhdGEuYXdzX3JvdXRlNTNfem9uZS53ZWJzZXJ2ZXJfem9uZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHXSUwQWRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFtaS0wZWE4MDc5OWE1OWFkMTA2Yl0lMEFtb2R1bGUud2Vic2l0ZS5hd3NfYWNtX2NlcnRpZmljYXRlLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6YWNtOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6Y2VydGlmaWNhdGUvNzcxZjEzMDQtMDI4Mi00MWU1LWI4OGUtN2Q0NDEzZDM3NDI4XSUwQW1vZHVsZS5jZG4uZGF0YS5hd3Nfcm91dGU1M196b25lLmloX2NvbTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHXSUwQW1vZHVsZS5jZG4uYXdzX3JvdXRlNTNfcmVjb3JkLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19jZG4uaW5mcmFob3VzZS5jb21fQV0lMEFtb2R1bGUuY2RuLmF3c19yb3V0ZTUzX3JlY29yZC5jZXJ0X3ZhbGlkYXRpb25bXCJjZG4uaW5mcmFob3VzZS5jb21cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19fYTcxZGJkMGVjZmMwNjBkMzE3OTQ0ZTNiZTFkYmY1OWIuY2RuLmluZnJhaG91c2UuY29tLl9DTkFNRV0lMEFtb2R1bGUud2Vic2l0ZS12cGMuZGF0YS5hd3NfdnBjLm1hbmFnZW1lbnRfdnBjWzBdOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD12cGMtMDhlMTlkODU5YzI2ZDE4YjJdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmRhdGEuYXdzX3JvdXRlX3RhYmxlcy5tZ210X3JvdXRlX3RhYmxlc1swXTogUmVhZGluZy4uLiUwQW1vZHVsZS5jZG4uYXdzX2FjbV9jZXJ0aWZpY2F0ZV92YWxpZGF0aW9uLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTIwMjMtMDgtMjEgMjM6MzM6NTguNjYzICswMDAwIFVUQ10lMEFtb2R1bGUud2Vic2l0ZS5hd3Nfcm91dGU1M19yZWNvcmQuY2VydF92YWxpZGF0aW9uW1wiaW5mcmFob3VzZS5jb21cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19fNzUwNGM1YzdiZGM0OWE2YmRjYWQ1MGZjN2Q2YjQ2OTcuaW5mcmFob3VzZS5jb20uX0NOQU1FXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5kYXRhLmF3c19yb3V0ZV90YWJsZXMubWdtdF9yb3V0ZV90YWJsZXNbMF06IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPXVzLXdlc3QtMV0lMEFtb2R1bGUud2Vic2l0ZS5hd3NfYWNtX2NlcnRpZmljYXRlX3ZhbGlkYXRpb24ud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MjAyMy0xMS0yNSAyMToyMDoyMy4yNDQgKzAwMDAgVVRDXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3NfZGVmYXVsdF9yb3V0ZV90YWJsZS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDZiNzAyYmRiMGNhZGQ4MTBdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c192cGNfcGVlcmluZ19jb25uZWN0aW9uLmxpbmtfdG9fbWFuYWdlbWVudFswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cGN4LTBmZDAwMDA4ZTlhODkwYjM1XSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuNC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMDg2Y2NmMWI3ODQyMjQzZDJdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19pbnRlcm5ldF9nYXRld2F5LmlnOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pZ3ctMGZlYjhmNTc5MDQ4ZmM0NDNdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19zdWJuZXQuYWxsW1wiMTAuMC43LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wNmYzNTIxODVmZmMzZmNkM10lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX2RlZmF1bHRfc2VjdXJpdHlfZ3JvdXAuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDg5ZjFhODVmMDVjYmQzMmFdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjUuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTBmYzY1Njc1ZTVjZTA3YmJmXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuNS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMDVmYTMzMTY0Yzc2OGFiNjVdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19zdWJuZXQuYWxsW1wiMTAuMC42LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wMTMwNmZhOWUxNGY5Yzk4MF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuNi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMGRlY2JiZjAxODIzODRkZmZdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjcuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTBmMGQ0YWI2NjUwZWQ0N2E0XSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC40LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wMmFlOWZjMzQ5MzI0ODM1Yl0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLmRlZmF1bHRfbWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDZiNzAyYmRiMGNhZGQ4MTAxMDgwMjg5NDk0XSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUucm91dGVfZnJvbV9tZ210X3RvX21lWzFdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wNGExNmU3NGQ1YjEyYTMzODMxNzc5NTczMzRdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5yb3V0ZV9mcm9tX21nbXRfdG9fbWVbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBkNzMzODNhZmViNmFkMTQyMzE3Nzk1NzMzNF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWdtdF90b19tZVsyXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDY3YzMwZTY1ZGQ0MTA4ZTkzMTc3OTU3MzM0XSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuNS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZmM2NTY3NWU1Y2UwN2JiZjEwODAyODk0OTRdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5zdWJuZXRfcHVibGljW1wiMTAuMC40LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTAyYWU5ZmMzNDkzMjQ4MzViMTA4MDI4OTQ5NF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWVfdG9fbWdtdFtcIjEwLjAuNi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZGVjYmJmMDE4MjM4NGRmZjY1Mzk1MjQ0OF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWVfdG9fbWdtdFtcIjEwLjAuNS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZmM2NTY3NWU1Y2UwN2JiZjY1Mzk1MjQ0OF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWVfdG9fbWdtdFtcIjEwLjAuNy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZjBkNGFiNjY1MGVkNDdhNDY1Mzk1MjQ0OF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWVfdG9fbWdtdFtcIjEwLjAuNC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wMmFlOWZjMzQ5MzI0ODM1YjY1Mzk1MjQ0OF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjUuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMDcxNjA0NWJhNWViMDkyZjBdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC42LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTBjMWEzZTRjODc0MzMzYmFmXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3NfbmF0X2dhdGV3YXkubmF0X2d3W1wiMTAuMC41LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5hdC0wMGFjMTlhZTQzNTYyMzUyZl0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX25hdF9nYXRld2F5Lm5hdF9nd1tcIjEwLjAuNC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1uYXQtMGExYzE2MDEyNzQ3ZWY1ZTRdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC43LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTBkYTBmZWE3ZDk5OWZjZjVmXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuNC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wNGQ3MTFhNGI5Mjg5NmJlMl0lMEFtb2R1bGUud2Vic2l0ZS5kYXRhLmF3c19zdWJuZXQuc2VsZWN0ZWQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnN1Ym5ldF9wcml2YXRlW1wiMTAuMC42LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBkZWNiYmYwMTgyMzg0ZGZmMTA4MDI4OTQ5NF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnN1Ym5ldF9wcml2YXRlW1wiMTAuMC43LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBmMGQ0YWI2NjUwZWQ0N2E0MTA4MDI4OTQ5NF0lMEFtb2R1bGUud2Vic2l0ZS5kYXRhLmF3c19zdWJuZXQuc2VsZWN0ZWQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXN1Ym5ldC0wODZjY2YxYjc4NDIyNDNkMl0lMEFtb2R1bGUud2Vic2l0ZS5kYXRhLmF3c192cGMuc2VydmljZTogUmVhZGluZy4uLiUwQW1vZHVsZS53ZWJzaXRlLmF3c19hbGJfdGFyZ2V0X2dyb3VwLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWxhc3RpY2xvYWRiYWxhbmNpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDp0YXJnZXRncm91cC90Zi0yMDIzMTIwNzE2MjIwODIxNTUwMDAwMDAwMS81Y2Q2NTA1ZTM5YWJkYjJiXSUwQW1vZHVsZS53ZWJzaXRlLmF3c19sYXVuY2hfdGVtcGxhdGUud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bHQtMDQyZWE1ZGQ1NWIwZmZmM2JdJTBBbW9kdWxlLndlYnNpdGUuYXdzX2FsYi53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6bG9hZGJhbGFuY2VyL2FwcC93ZWIyMDIzMDgxODE3MDgyMTMxNzEwMDAwMDAwOC8wM2E2NGI4ZmM5ZjBmMDU1XSUwQW1vZHVsZS53ZWJzaXRlLmRhdGEuYXdzX3ZwYy5zZXJ2aWNlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD12cGMtMGFlNzk4Zjk0MWJlNDUzNDVdJTBBbW9kdWxlLndlYnNpdGUuYXdzX3JvdXRlNTNfcmVjb3JkLmV4dHJhWzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fQV0lMEFtb2R1bGUud2Vic2l0ZS5hd3NfYWxiX2xpc3RlbmVyLnJlZGlyZWN0X3RvX3NzbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0Omxpc3RlbmVyL2FwcC93ZWIyMDIzMDgxODE3MDgyMTMxNzEwMDAwMDAwOC8wM2E2NGI4ZmM5ZjBmMDU1LzNkOTg0YmM5ZjFjYzNhN2RdJTBBbW9kdWxlLndlYnNpdGUuYXdzX2xiX2xpc3RlbmVyLnNzbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0Omxpc3RlbmVyL2FwcC93ZWIyMDIzMDgxODE3MDgyMTMxNzEwMDAwMDAwOC8wM2E2NGI4ZmM5ZjBmMDU1L2I5MzhjZmRmYTIyMWVmNGRdJTBBbW9kdWxlLndlYnNpdGUuYXdzX2F1dG9zY2FsaW5nX2dyb3VwLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYjIwMjMxMTI1MjA1MjM5NDI4NzAwMDAwMDAzXSUwQW1vZHVsZS53ZWJzaXRlLmF3c19hdXRvc2NhbGluZ19wb2xpY3kuY3B1X2xvYWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYjIwMjMxMTI1MjA1MjM5NDI4NzAwMDAwMDAzXSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICArIGNyZWF0ZSUwQSAgfiB1cGRhdGUgaW4tcGxhY2UlMEElMEFUZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczolMEElMEEgICMgbW9kdWxlLndlYnNpdGUuYXdzX2FsYi53ZWJzaXRlIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZSUwQSAgfiByZXNvdXJjZSBcImF3c19hbGJcIiBcIndlYnNpdGVcIiB7JTBBICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6bG9hZGJhbGFuY2VyL2FwcC93ZWIyMDIzMDgxODE3MDgyMTMxNzEwMDAwMDAwOC8wM2E2NGI4ZmM5ZjBmMDU1XCIlMEEgICAgICAgIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIndlYjIwMjMwODE4MTcwODIxMzE3MTAwMDAwMDA4XCIlMEEgICAgICB+IHNlY3VyaXR5X2dyb3VwcyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbJTBBICAgICAgICAgIC0gXCJzZy0wODlmMWE4NWYwNWNiZDMyYVwiLCUwQSAgICAgICAgXSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge30lMEEgICAgICAgICMgKDIyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEElMEEgICAgICAgICMgKDQgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLndlYnNpdGUuYXdzX2F1dG9zY2FsaW5nX2dyb3VwLndlYnNpdGUgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlJTBBICB+IHJlc291cmNlIFwiYXdzX2F1dG9zY2FsaW5nX2dyb3VwXCIgXCJ3ZWJzaXRlXCIgeyUwQSAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIndlYjIwMjMxMTI1MjA1MjM5NDI4NzAwMDAwMDAzXCIlMEEgICAgICAgIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ3ZWIyMDIzMTEyNTIwNTIzOTQyODcwMDAwMDAwM1wiJTBBICAgICAgICAjICgyOCB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBJTBBICAgICAgfiBpbnN0YW5jZV9yZWZyZXNoIHslMEEgICAgICAgICAgICAjICgyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEElMEEgICAgICAgICAgfiBwcmVmZXJlbmNlcyB7JTBBICAgICAgICAgICAgICB+IG1heF9oZWFsdGh5X3BlcmNlbnRhZ2UgICAgICAgPSAwIC0+IDEwMCUwQSAgICAgICAgICAgICAgICAjICg2IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEEgICAgICAgICAgICB9JTBBICAgICAgICB9JTBBJTBBICAgICAgfiBsYXVuY2hfdGVtcGxhdGUgeyUwQSAgICAgICAgICAgIGlkICAgICAgPSBcImx0LTA0MmVhNWRkNTViMGZmZjNiXCIlMEEgICAgICAgICAgICBuYW1lICAgID0gXCJ3ZWIyMDIzMTEyNTIwNTE1MTIxMzIwMDAwMDAwMVwiJTBBICAgICAgICAgIH4gdmVyc2lvbiA9IFwiNFwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgIH0lMEElMEEgICAgICAgICMgKDYgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLndlYnNpdGUuYXdzX2xhdW5jaF90ZW1wbGF0ZS53ZWJzaXRlIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZSUwQSAgfiByZXNvdXJjZSBcImF3c19sYXVuY2hfdGVtcGxhdGVcIiBcIndlYnNpdGVcIiB7JTBBICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICA9IFwibHQtMDQyZWE1ZGQ1NWIwZmZmM2JcIiUwQSAgICAgIH4gaW1hZ2VfaWQgICAgICAgICAgICAgICAgPSBcImFtaS0wY2UyY2IzNTM4NmZjMjJlOVwiIC0+IFwiYW1pLTBlYTgwNzk5YTU5YWQxMDZiXCIlMEEgICAgICB+IGxhdGVzdF92ZXJzaW9uICAgICAgICAgID0gNCAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICBuYW1lICAgICAgICAgICAgICAgICAgICA9IFwid2ViMjAyMzExMjUyMDUxNTEyMTMyMDAwMDAwMDFcIiUwQSAgICAgICAgdGFncyAgICAgICAgICAgICAgICAgICAgPSB7fSUwQSAgICAgIH4gdnBjX3NlY3VyaXR5X2dyb3VwX2lkcyAgPSBbXSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAjICgxMCB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBJTBBICAgICAgICAjICgyIHVuY2hhbmdlZCBibG9ja3MgaGlkZGVuKSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS53ZWJzaXRlLmF3c19zZWN1cml0eV9ncm91cC5hbGIgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3NlY3VyaXR5X2dyb3VwXCIgXCJhbGJcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICA9IFwiTG9hZCBiYWxhbmNlciBzZWN1cml0eSBncm91cCBmb3Igc2VydmljZSB3ZWJzaXRlXCIlMEEgICAgICArIGVncmVzcyAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaW5ncmVzcyAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgID0gXCJ3ZWItXCIlMEEgICAgICArIG93bmVyX2lkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByZXZva2VfcnVsZXNfb25fZGVsZXRlID0gZmFsc2UlMEEgICAgICArIHRhZ3MgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgPSBcIndlYnNpdGUgbG9hZCBiYWxhbmNlclwiJTBBICAgICAgICB9JTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwid2Vic2l0ZSBsb2FkIGJhbGFuY2VyXCIlMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgfSUwQSAgICAgICsgdnBjX2lkICAgICAgICAgICAgICAgICA9IFwidnBjLTBhZTc5OGY5NDFiZTQ1MzQ1XCIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS5hd3Nfc2VjdXJpdHlfZ3JvdXAuYmFja2VuZCB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3Nfc2VjdXJpdHlfZ3JvdXBcIiBcImJhY2tlbmRcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICA9IFwiQmFja2VuZCBzZWN1cml0eSBncm91cCBmb3Igc2VydmljZSB3ZWJzaXRlXCIlMEEgICAgICArIGVncmVzcyAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaW5ncmVzcyAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgID0gXCJ3ZWItXCIlMEEgICAgICArIG93bmVyX2lkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByZXZva2VfcnVsZXNfb25fZGVsZXRlID0gZmFsc2UlMEEgICAgICArIHRhZ3MgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgPSBcIndlYnNpdGUgYmFja2VuZFwiJTBBICAgICAgICB9JTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwid2Vic2l0ZSBiYWNrZW5kXCIlMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgfSUwQSAgICAgICsgdnBjX2lkICAgICAgICAgICAgICAgICA9IFwidnBjLTBhZTc5OGY5NDFiZTQ1MzQ1XCIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2VncmVzc19ydWxlLmFsYl9vdXRnb2luZyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2VncmVzc19ydWxlXCIgXCJhbGJfb3V0Z29pbmdcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgY2lkcl9pcHY0ICAgICAgICAgICAgICA9IFwiMC4wLjAuMC8wXCIlMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpcF9wcm90b2NvbCAgICAgICAgICAgID0gXCItMVwiJTBBICAgICAgKyBzZWN1cml0eV9ncm91cF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc2VjdXJpdHlfZ3JvdXBfcnVsZV9pZCA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3MgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgPSBcIm91dGdvaW5nIHRyYWZmaWNcIiUwQSAgICAgICAgfSUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIm91dGdvaW5nIHRyYWZmaWNcIiUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLndlYnNpdGUuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5iYWNrZW5kX291dGdvaW5nIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c192cGNfc2VjdXJpdHlfZ3JvdXBfZWdyZXNzX3J1bGVcIiBcImJhY2tlbmRfb3V0Z29pbmdcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgY2lkcl9pcHY0ICAgICAgICAgICAgICA9IFwiMC4wLjAuMC8wXCIlMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpcF9wcm90b2NvbCAgICAgICAgICAgID0gXCItMVwiJTBBICAgICAgKyBzZWN1cml0eV9ncm91cF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc2VjdXJpdHlfZ3JvdXBfcnVsZV9pZCA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3MgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgPSBcIm91dGdvaW5nIHRyYWZmaWNcIiUwQSAgICAgICAgfSUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIm91dGdvaW5nIHRyYWZmaWNcIiUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLndlYnNpdGUuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYWxiX2ljbXAgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGVcIiBcImFsYl9pY21wXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGNpZHJfaXB2NCAgICAgICAgICAgICAgPSBcIjAuMC4wLjAvMFwiJTBBICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgID0gXCJBbGxvdyBhbGwgSUNNUCB0cmFmZmljXCIlMEEgICAgICArIGZyb21fcG9ydCAgICAgICAgICAgICAgPSAtMSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlwX3Byb3RvY29sICAgICAgICAgICAgPSBcImljbXBcIiUwQSAgICAgICsgc2VjdXJpdHlfZ3JvdXBfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHNlY3VyaXR5X2dyb3VwX3J1bGVfaWQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiID0gXCJJQ01QIHRyYWZmaWNcIiUwQSAgICAgICAgfSUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIklDTVAgdHJhZmZpY1wiJTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgIH0lMEEgICAgICArIHRvX3BvcnQgICAgICAgICAgICAgICAgPSAtMSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS53ZWJzaXRlLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmFsYl9saXN0ZW5lcl9wb3J0IHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlXCIgXCJhbGJfbGlzdGVuZXJfcG9ydFwiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBjaWRyX2lwdjQgICAgICAgICAgICAgID0gXCIwLjAuMC4wLzBcIiUwQSAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICA9IFwiVXNlciB0cmFmZmljIHRvIHBvcnQgODBcIiUwQSAgICAgICsgZnJvbV9wb3J0ICAgICAgICAgICAgICA9IDgwJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaXBfcHJvdG9jb2wgICAgICAgICAgICA9IFwidGNwXCIlMEEgICAgICArIHNlY3VyaXR5X2dyb3VwX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzZWN1cml0eV9ncm91cF9ydWxlX2lkID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiA9IFwidXNlciB0cmFmZmljXCIlMEEgICAgICAgIH0lMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJ1c2VyIHRyYWZmaWNcIiUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9JTBBICAgICAgKyB0b19wb3J0ICAgICAgICAgICAgICAgID0gODAlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5iYWNrZW5kX2ljbXAgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGVcIiBcImJhY2tlbmRfaWNtcFwiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBjaWRyX2lwdjQgICAgICAgICAgICAgID0gXCIwLjAuMC4wLzBcIiUwQSAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICA9IFwiQWxsb3cgYWxsIElDTVAgdHJhZmZpY1wiJTBBICAgICAgKyBmcm9tX3BvcnQgICAgICAgICAgICAgID0gLTElMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpcF9wcm90b2NvbCAgICAgICAgICAgID0gXCJpY21wXCIlMEEgICAgICArIHNlY3VyaXR5X2dyb3VwX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzZWN1cml0eV9ncm91cF9ydWxlX2lkID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiA9IFwiSUNNUCB0cmFmZmljXCIlMEEgICAgICAgIH0lMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJJQ01QIHRyYWZmaWNcIiUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9JTBBICAgICAgKyB0b19wb3J0ICAgICAgICAgICAgICAgID0gLTElMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5iYWNrZW5kX3NzaF9pbnB1dCB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZVwiIFwiYmFja2VuZF9zc2hfaW5wdXRcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgY2lkcl9pcHY0ICAgICAgICAgICAgICA9IFwiMTAuMC4wLjAvMjJcIiUwQSAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICA9IFwiU1NIIGFjY2VzcyBmcm9tIHRoZSBzZXJ2aWNlIHNwZWNpZmllZCBDSURSIHJhbmdlXCIlMEEgICAgICArIGZyb21fcG9ydCAgICAgICAgICAgICAgPSAyMiUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlwX3Byb3RvY29sICAgICAgICAgICAgPSBcInRjcFwiJTBBICAgICAgKyBzZWN1cml0eV9ncm91cF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc2VjdXJpdHlfZ3JvdXBfcnVsZV9pZCA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3MgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgPSBcIlNTSCBhZGRpdGlvbmFsXCIlMEEgICAgICAgIH0lMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJTU0ggYWRkaXRpb25hbFwiJTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgIH0lMEEgICAgICArIHRvX3BvcnQgICAgICAgICAgICAgICAgPSAyMiUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS53ZWJzaXRlLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmJhY2tlbmRfc3NoX2xvY2FsIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlXCIgXCJiYWNrZW5kX3NzaF9sb2NhbFwiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBjaWRyX2lwdjQgICAgICAgICAgICAgID0gXCIxMC4wLjQuMC8yMlwiJTBBICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgID0gXCJTU0ggYWNjZXNzIGZyb20gdGhlIHNlcnZpY2Ugd2Vic2l0ZSBWUENcIiUwQSAgICAgICsgZnJvbV9wb3J0ICAgICAgICAgICAgICA9IDIyJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaXBfcHJvdG9jb2wgICAgICAgICAgICA9IFwidGNwXCIlMEEgICAgICArIHNlY3VyaXR5X2dyb3VwX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzZWN1cml0eV9ncm91cF9ydWxlX2lkID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiA9IFwiU1NIIGxvY2FsXCIlMEEgICAgICAgIH0lMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJTU0ggbG9jYWxcIiUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9JTBBICAgICAgKyB0b19wb3J0ICAgICAgICAgICAgICAgID0gMjIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5iYWNrZW5kX3VzZXJfdHJhZmZpYyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZVwiIFwiYmFja2VuZF91c2VyX3RyYWZmaWNcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgY2lkcl9pcHY0ICAgICAgICAgICAgICA9IFwiMTAuMC40LjAvMjJcIiUwQSAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICA9IFwiVXNlciB0cmFmZmljIGZyb20gdGhlIExvYWQgQmFsYW5jZXJcIiUwQSAgICAgICsgZnJvbV9wb3J0ICAgICAgICAgICAgICA9IDgwJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaXBfcHJvdG9jb2wgICAgICAgICAgICA9IFwidGNwXCIlMEEgICAgICArIHNlY3VyaXR5X2dyb3VwX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzZWN1cml0eV9ncm91cF9ydWxlX2lkID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiA9IFwidXNlciB0cmFmZmljXCIlMEEgICAgICAgIH0lMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJ1c2VyIHRyYWZmaWNcIiUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9JTBBICAgICAgKyB0b19wb3J0ICAgICAgICAgICAgICAgID0gODAlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUud2Vic2l0ZS5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5odHRwcyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZVwiIFwiaHR0cHNcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgY2lkcl9pcHY0ICAgICAgICAgICAgICA9IFwiMC4wLjAuMC8wXCIlMEEgICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgPSBcIlVzZXIgdHJhZmZpYyB0byBIVFRQUyBwb3J0XCIlMEEgICAgICArIGZyb21fcG9ydCAgICAgICAgICAgICAgPSA0NDMlMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpcF9wcm90b2NvbCAgICAgICAgICAgID0gXCJ0Y3BcIiUwQSAgICAgICsgc2VjdXJpdHlfZ3JvdXBfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHNlY3VyaXR5X2dyb3VwX3J1bGVfaWQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiID0gXCJodHRwcyB1c2VyIHRyYWZmaWNcIiUwQSAgICAgICAgfSUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcImh0dHBzIHVzZXIgdHJhZmZpY1wiJTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgIH0lMEEgICAgICArIHRvX3BvcnQgICAgICAgICAgICAgICAgPSA0NDMlMEEgICAgfSUwQSUwQVBsYW46IDExIHRvIGFkZCwgMyB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS4lMEElMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDAlMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFcbjo6ZGVidWc6OnN0ZGVycjogXG46OmRlYnVnOjpleGl0Y29kZTogMCIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDExLCAiY2hhbmdlIjogMywgImRlc3Ryb3kiOiAwfX0=```
</p></details>